Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.1.98/include/proc/p32mz2064dal169.h
extern volatile __USBE5CSR1bits_t USBE5CSR1bits __asm__ ("USBE5CSR1") __attribute__((section("sfrs"), address(0xBF8E3154)));
#define USBE5CSR2 USBE5CSR2
extern volatile uint32_t   USBE5CSR2 __attribute__((section("sfrs"), address(0xBF8E3158)));
typedef struct {
  uint32_t RXCNT:14;
  uint32_t :2;
  uint32_t TEP:4;
  uint32_t PROTOCOL:2;
  uint32_t SPEED:2;
  uint32_t TXINTERV:8;
} __USBE5CSR2bits_t;
extern volatile __USBE5CSR2bits_t USBE5CSR2bits __asm__ ("USBE5CSR2") __attribute__((section("sfrs"), address(0xBF8E3158)));
#define USBE5CSR3 USBE5CSR3
extern volatile uint32_t   USBE5CSR3 __attribute__((section("sfrs"), address(0xBF8E315C)));
typedef struct {
  uint32_t TEP:4;
  uint32_t PROTOCOL:2;
  uint32_t SPEED:2;
  uint32_t RXINTERV:8;
  uint32_t :8;
  uint32_t TXFIFOSZ:4;
  uint32_t RXFIFOSZ:4;
} __USBE5CSR3bits_t;
extern volatile __USBE5CSR3bits_t USBE5CSR3bits __asm__ ("USBE5CSR3") __attribute__((section("sfrs"), address(0xBF8E315C)));
#define USBE6CSR0 USBE6CSR0
extern volatile uint32_t   USBE6CSR0 __attribute__((section("sfrs"), address(0xBF8E3160)));
typedef union {
  struct {
    uint32_t TXMAXP:11;
    uint32_t MULT:5;
    uint32_t TXPKTRDY:1;
    uint32_t FIFONE:1;
    uint32_t ERROR:1;
    uint32_t FLUSH:1;
    uint32_t SETUPPKT:1;
    uint32_t RXSTALL:1;
    uint32_t CLRDT:1;
    uint32_t NAKTMOUT:1;
    uint32_t DATATGGL:1;
    uint32_t DTWREN:1;
    uint32_t DMAREQMD:1;
    uint32_t FRCDATTG:1;
    uint32_t DMAREQEN:1;
    uint32_t MODE:1;
    uint32_t :1;
    uint32_t AUTOSET:1;
  };
  struct {
    uint32_t :18;
    uint32_t UNDERRUN:1;
    uint32_t :1;
    uint32_t SENDSTALL:1;
    uint32_t SENTSTALL:1;
    uint32_t :1;
    uint32_t INCOMPTX:1;
    uint32_t :6;
    uint32_t ISO:1;
  };
} __USBE6CSR0bits_t;
extern volatile __USBE6CSR0bits_t USBE6CSR0bits __asm__ ("USBE6CSR0") __attribute__((section("sfrs"), address(0xBF8E3160)));
#define USBE6CSR1 USBE6CSR1
extern volatile uint32_t   USBE6CSR1 __attribute__((section("sfrs"), address(0xBF8E3164)));
typedef union {
  struct {
    uint32_t RXMAXP:11;
    uint32_t MULT:5;
    uint32_t RXPKTRDY:1;
    uint32_t FIFOFULL:1;
    uint32_t ERROR:1;
    uint32_t DERRNAKT:1;
    uint32_t FLUSH:1;
    uint32_t REQPKT:1;
    uint32_t RXSTALL:1;
    uint32_t CLRDT:1;
    uint32_t INCOMPRX:1;
    uint32_t DATATGGL:1;
    uint32_t DATATWEN:1;
    uint32_t DMAREQMD:1;
    uint32_t PIDERR:1;
    uint32_t DMAREQEN:1;
    uint32_t AUTORQ:1;
    uint32_t AUTOCLR:1;
  };
  struct {
    uint32_t :18;
    uint32_t UNDERRUN:1;
    uint32_t :1;
    uint32_t SENDSTALL:1;
    uint32_t SENTSTALL:1;
    uint32_t :1;
    uint32_t INCOMPTX:1;
    uint32_t :6;
    uint32_t ISO:1;
  };
} __USBE6CSR1bits_t;
extern volatile __USBE6CSR1bits_t USBE6CSR1bits __asm__ ("USBE6CSR1") __attribute__((section("sfrs"), address(0xBF8E3164)));
#define USBE6CSR2 USBE6CSR2
extern volatile uint32_t   USBE6CSR2 __attribute__((section("sfrs"), address(0xBF8E3168)));
typedef struct {
  uint32_t RXCNT:14;
  uint32_t :2;
  uint32_t TEP:4;
  uint32_t PROTOCOL:2;
  uint32_t SPEED:2;
  uint32_t TXINTERV:8;
} __USBE6CSR2bits_t;
extern volatile __USBE6CSR2bits_t USBE6CSR2bits __asm__ ("USBE6CSR2") __attribute__((section("sfrs"), address(0xBF8E3168)));
#define USBE6CSR3 USBE6CSR3
extern volatile uint32_t   USBE6CSR3 __attribute__((section("sfrs"), address(0xBF8E316C)));
typedef struct {
  uint32_t TEP:4;
  uint32_t PROTOCOL:2;
  uint32_t SPEED:2;
  uint32_t RXINTERV:8;
  uint32_t :8;
  uint32_t TXFIFOSZ:4;
  uint32_t RXFIFOSZ:4;
} __USBE6CSR3bits_t;
extern volatile __USBE6CSR3bits_t USBE6CSR3bits __asm__ ("USBE6CSR3") __attribute__((section("sfrs"), address(0xBF8E316C)));
#define USBE7CSR0 USBE7CSR0
extern volatile uint32_t   USBE7CSR0 __attribute__((section("sfrs"), address(0xBF8E3170)));
typedef union {
  struct {
    uint32_t TXMAXP:11;
    uint32_t MULT:5;
    uint32_t TXPKTRDY:1;
    uint32_t FIFONE:1;
    uint32_t ERROR:1;
    uint32_t FLUSH:1;
    uint32_t SETUPPKT:1;
    uint32_t RXSTALL:1;
    uint32_t CLRDT:1;
    uint32_t NAKTMOUT:1;
    uint32_t DATATGGL:1;
    uint32_t DTWREN:1;
    uint32_t DMAREQMD:1;
    uint32_t FRCDATTG:1;
    uint32_t DMAREQEN:1;
    uint32_t MODE:1;
    uint32_t :1;
    uint32_t AUTOSET:1;
  };
  struct {
    uint32_t :18;
    uint32_t UNDERRUN:1;
    uint32_t :1;
    uint32_t SENDSTALL:1;
    uint32_t SENTSTALL:1;
    uint32_t :1;
    uint32_t INCOMPTX:1;
    uint32_t :6;
    uint32_t ISO:1;
  };
} __USBE7CSR0bits_t;
extern volatile __USBE7CSR0bits_t USBE7CSR0bits __asm__ ("USBE7CSR0") __attribute__((section("sfrs"), address(0xBF8E3170)));
#define USBE7CSR1 USBE7CSR1
extern volatile uint32_t   USBE7CSR1 __attribute__((section("sfrs"), address(0xBF8E3174)));
typedef union {
  struct {
    uint32_t RXMAXP:11;
    uint32_t MULT:5;
    uint32_t RXPKTRDY:1;
    uint32_t FIFOFULL:1;
    uint32_t ERROR:1;
    uint32_t DERRNAKT:1;
    uint32_t FLUSH:1;
    uint32_t REQPKT:1;
    uint32_t RXSTALL:1;
    uint32_t CLRDT:1;
    uint32_t INCOMPRX:1;
    uint32_t DATATGGL:1;
    uint32_t DATATWEN:1;
    uint32_t DMAREQMD:1;
    uint32_t PIDERR:1;
    uint32_t DMAREQEN:1;
    uint32_t AUTORQ:1;
    uint32_t AUTOCLR:1;
  };
  struct {
    uint32_t :18;
    uint32_t UNDERRUN:1;
    uint32_t :1;
    uint32_t SENDSTALL:1;
    uint32_t SENTSTALL:1;
    uint32_t :1;
    uint32_t INCOMPTX:1;
    uint32_t :6;
    uint32_t ISO:1;
  };
} __USBE7CSR1bits_t;
extern volatile __USBE7CSR1bits_t USBE7CSR1bits __asm__ ("USBE7CSR1") __attribute__((section("sfrs"), address(0xBF8E3174)));
#define USBE7CSR2 USBE7CSR2
extern volatile uint32_t   USBE7CSR2 __attribute__((section("sfrs"), address(0xBF8E3178)));
typedef struct {
  uint32_t RXCNT:14;
  uint32_t :2;
  uint32_t TEP:4;
  uint32_t PROTOCOL:2;
  uint32_t SPEED:2;
  uint32_t TXINTERV:8;
} __USBE7CSR2bits_t;
extern volatile __USBE7CSR2bits_t USBE7CSR2bits __asm__ ("USBE7CSR2") __attribute__((section("sfrs"), address(0xBF8E3178)));
#define USBE7CSR3 USBE7CSR3
extern volatile uint32_t   USBE7CSR3 __attribute__((section("sfrs"), address(0xBF8E317C)));
typedef struct {
  uint32_t TEP:4;
  uint32_t PROTOCOL:2;
  uint32_t SPEED:2;
  uint32_t RXINTERV:8;
  uint32_t :8;
  uint32_t TXFIFOSZ:4;
  uint32_t RXFIFOSZ:4;
} __USBE7CSR3bits_t;
