Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.1.98/include/proc/p32mz2064dal169.h
#define _CNENJ_CNIEJ14_POSITION                  0x0000000E
#define _CNENJ_CNIEJ14_MASK                      0x00004000
#define _CNENJ_CNIEJ14_LENGTH                    0x00000001

#define _CNENJ_CNIEJ15_POSITION                  0x0000000F
#define _CNENJ_CNIEJ15_MASK                      0x00008000
#define _CNENJ_CNIEJ15_LENGTH                    0x00000001

#define _CNENJ_w_POSITION                        0x00000000
#define _CNENJ_w_MASK                            0xFFFFFFFF
#define _CNENJ_w_LENGTH                          0x00000020

#define _CNSTATJ_CNSTATJ0_POSITION               0x00000000
#define _CNSTATJ_CNSTATJ0_MASK                   0x00000001
#define _CNSTATJ_CNSTATJ0_LENGTH                 0x00000001

#define _CNSTATJ_CNSTATJ1_POSITION               0x00000001
#define _CNSTATJ_CNSTATJ1_MASK                   0x00000002
#define _CNSTATJ_CNSTATJ1_LENGTH                 0x00000001

#define _CNSTATJ_CNSTATJ2_POSITION               0x00000002
#define _CNSTATJ_CNSTATJ2_MASK                   0x00000004
#define _CNSTATJ_CNSTATJ2_LENGTH                 0x00000001

#define _CNSTATJ_CNSTATJ3_POSITION               0x00000003
#define _CNSTATJ_CNSTATJ3_MASK                   0x00000008
#define _CNSTATJ_CNSTATJ3_LENGTH                 0x00000001

#define _CNSTATJ_CNSTATJ4_POSITION               0x00000004
#define _CNSTATJ_CNSTATJ4_MASK                   0x00000010
#define _CNSTATJ_CNSTATJ4_LENGTH                 0x00000001

#define _CNSTATJ_CNSTATJ5_POSITION               0x00000005
#define _CNSTATJ_CNSTATJ5_MASK                   0x00000020
#define _CNSTATJ_CNSTATJ5_LENGTH                 0x00000001

#define _CNSTATJ_CNSTATJ6_POSITION               0x00000006
#define _CNSTATJ_CNSTATJ6_MASK                   0x00000040
#define _CNSTATJ_CNSTATJ6_LENGTH                 0x00000001

#define _CNSTATJ_CNSTATJ7_POSITION               0x00000007
#define _CNSTATJ_CNSTATJ7_MASK                   0x00000080
#define _CNSTATJ_CNSTATJ7_LENGTH                 0x00000001

#define _CNSTATJ_CNSTATJ8_POSITION               0x00000008
#define _CNSTATJ_CNSTATJ8_MASK                   0x00000100
#define _CNSTATJ_CNSTATJ8_LENGTH                 0x00000001

#define _CNSTATJ_CNSTATJ9_POSITION               0x00000009
#define _CNSTATJ_CNSTATJ9_MASK                   0x00000200
#define _CNSTATJ_CNSTATJ9_LENGTH                 0x00000001

#define _CNSTATJ_CNSTATJ10_POSITION              0x0000000A
#define _CNSTATJ_CNSTATJ10_MASK                  0x00000400
#define _CNSTATJ_CNSTATJ10_LENGTH                0x00000001

#define _CNSTATJ_CNSTATJ11_POSITION              0x0000000B
#define _CNSTATJ_CNSTATJ11_MASK                  0x00000800
#define _CNSTATJ_CNSTATJ11_LENGTH                0x00000001

#define _CNSTATJ_CNSTATJ12_POSITION              0x0000000C
#define _CNSTATJ_CNSTATJ12_MASK                  0x00001000
#define _CNSTATJ_CNSTATJ12_LENGTH                0x00000001

#define _CNSTATJ_CNSTATJ13_POSITION              0x0000000D
#define _CNSTATJ_CNSTATJ13_MASK                  0x00002000
#define _CNSTATJ_CNSTATJ13_LENGTH                0x00000001

#define _CNSTATJ_CNSTATJ14_POSITION              0x0000000E
#define _CNSTATJ_CNSTATJ14_MASK                  0x00004000
#define _CNSTATJ_CNSTATJ14_LENGTH                0x00000001

#define _CNSTATJ_CNSTATJ15_POSITION              0x0000000F
#define _CNSTATJ_CNSTATJ15_MASK                  0x00008000
#define _CNSTATJ_CNSTATJ15_LENGTH                0x00000001

#define _CNSTATJ_w_POSITION                      0x00000000
#define _CNSTATJ_w_MASK                          0xFFFFFFFF
#define _CNSTATJ_w_LENGTH                        0x00000020

#define _CNNEJ_CNNEJ0_POSITION                   0x00000000
#define _CNNEJ_CNNEJ0_MASK                       0x00000001
#define _CNNEJ_CNNEJ0_LENGTH                     0x00000001

#define _CNNEJ_CNNEJ1_POSITION                   0x00000001
#define _CNNEJ_CNNEJ1_MASK                       0x00000002
#define _CNNEJ_CNNEJ1_LENGTH                     0x00000001

#define _CNNEJ_CNNEJ2_POSITION                   0x00000002
#define _CNNEJ_CNNEJ2_MASK                       0x00000004
#define _CNNEJ_CNNEJ2_LENGTH                     0x00000001

#define _CNNEJ_CNNEJ3_POSITION                   0x00000003
#define _CNNEJ_CNNEJ3_MASK                       0x00000008
#define _CNNEJ_CNNEJ3_LENGTH                     0x00000001

#define _CNNEJ_CNNEJ4_POSITION                   0x00000004
#define _CNNEJ_CNNEJ4_MASK                       0x00000010
#define _CNNEJ_CNNEJ4_LENGTH                     0x00000001

#define _CNNEJ_CNNEJ5_POSITION                   0x00000005
#define _CNNEJ_CNNEJ5_MASK                       0x00000020
#define _CNNEJ_CNNEJ5_LENGTH                     0x00000001

#define _CNNEJ_CNNEJ6_POSITION                   0x00000006
#define _CNNEJ_CNNEJ6_MASK                       0x00000040
#define _CNNEJ_CNNEJ6_LENGTH                     0x00000001

#define _CNNEJ_CNNEJ7_POSITION                   0x00000007
#define _CNNEJ_CNNEJ7_MASK                       0x00000080
#define _CNNEJ_CNNEJ7_LENGTH                     0x00000001

#define _CNNEJ_CNNEJ8_POSITION                   0x00000008
#define _CNNEJ_CNNEJ8_MASK                       0x00000100
#define _CNNEJ_CNNEJ8_LENGTH                     0x00000001

#define _CNNEJ_CNNEJ9_POSITION                   0x00000009
#define _CNNEJ_CNNEJ9_MASK                       0x00000200
#define _CNNEJ_CNNEJ9_LENGTH                     0x00000001

#define _CNNEJ_CNNEJ10_POSITION                  0x0000000A
#define _CNNEJ_CNNEJ10_MASK                      0x00000400
#define _CNNEJ_CNNEJ10_LENGTH                    0x00000001

#define _CNNEJ_CNNEJ11_POSITION                  0x0000000B
#define _CNNEJ_CNNEJ11_MASK                      0x00000800
#define _CNNEJ_CNNEJ11_LENGTH                    0x00000001

#define _CNNEJ_CNNEJ12_POSITION                  0x0000000C
#define _CNNEJ_CNNEJ12_MASK                      0x00001000
#define _CNNEJ_CNNEJ12_LENGTH                    0x00000001

#define _CNNEJ_CNNEJ13_POSITION                  0x0000000D
#define _CNNEJ_CNNEJ13_MASK                      0x00002000
#define _CNNEJ_CNNEJ13_LENGTH                    0x00000001

